# coding: utf-8
#===============================================================================
# ■ F5でウィンドウ拡大さん for RGSS3
# ※ このスクリプトは「HZM_VXAベーススクリプトさん for RGSS3」が必要です
#-------------------------------------------------------------------------------
#　2012/08/01　Ru/むっくRu
#-------------------------------------------------------------------------------
#  RPGツクール2000・2003のようにF5キーを押すと
#  ウィンドウが伸び縮みする機能を追加します．
#-------------------------------------------------------------------------------
# 【注意】
#  無理やりなので不具合などが含まれてる可能性が非常に高いです．
#  バグが出ると絶対困る困るな人は【使わないことを強く推奨】します．
#-------------------------------------------------------------------------------
# 【更新履歴】
# 2012/08/01 ベーススクリプト仕様変更に対応
# 2012/01/07 ぶっぱ
#-------------------------------------------------------------------------------

raise '「HZM_VXAベーススクリプトさん for RGSS3」が必要です' unless defined?(HZM_VXA::Base)
raise '「HZM_VXAベーススクリプトさん for RGSS3」のバージョンが異なります' unless HZM_VXA::Base.check_version?('2.0.0')

#===============================================================================
# ● 設定項目
#==============================================================================
module HZM_VXA
  module F5Zoom
    # 拡大縮小に使うキーのID
    ZOOM_KEY = :F5
  end
end

#===============================================================================
# ↑ 　 ここまで設定 　 ↑
# ↓ 以下、スクリプト部 ↓
#===============================================================================

module HZM_VXA
  module F5Zoom
    @zoomed = false
    #---------------------------------------------------------------------------
    # ● チェック
    #---------------------------------------------------------------------------
    def self.update
      if ::Input.trigger?(ZOOM_KEY)
        n = @zoomed ? 1.0 : 2.0
        @zoomed = !@zoomed if HZM_VXA::Base.window_zoom(n)
      end
    end
  end
end

class Scene_Base
  #-----------------------------------------------------------------------------
  # ● 更新（エイリアス）
  #-----------------------------------------------------------------------------
  alias hzm_vxa_f5zoom_update update
  def update
    hzm_vxa_f5zoom_update
    HZM_VXA::F5Zoom.update
  end
end
